{
  "demoRequestSentTitle": "¡Solicitud Recibida!",
  "demoRequestSentDescription": "Gracias por tu interés en Kary. Nos pondremos en contacto muy pronto.",
  "loginSuccessTitle": "¡Bienvenido/a de Nuevo!",
  "loginSuccessDescription": "Has iniciado sesión como {userIdentifier}. Redirigiendo a tu panel...",
  "loginErrorTitle": "Error de Inicio de Sesión",
  "errorTitle": "¡Ups! Algo Salió Mal",
  "demoRequestErrorDescription": "No pudimos enviar tu solicitud de demo. Revisa tus datos e inténtalo de nuevo.",
  "loginErrorDefault": "No pudimos iniciar tu sesión. Revisa tus datos o inténtalo más tarde.",
  "loginErrorInvalidCredentials": "El correo electrónico o la contraseña son incorrectos. ¿Seguro que están bien escritos?",
  "loginErrorEmailNotConfirmed": "Parece que tu correo no ha sido confirmado. Revisa tu bandeja de entrada (y spam) buscando un mensaje de Kary.",
  "loginErrorUnknown": "Ocurrió un error inesperado. Inténtalo de nuevo o contacta a soporte si el problema persiste.",
  "infoTitle": "Información",
  "warningTitle": "Advertencia",
  "successTitle": "¡Éxito!",
  "getEmotionalTrendSummary": "La función getEmotionalTrendSummary no está definida correctamente en el servicio.",
  "errorLoadingInfoTitle": "Error al cargar la información",
  "errorLoadingInfoDescription": "No se pudieron obtener los planes de apoyo o el resumen del panel debido a un conflicto en la base de datos. Estamos trabajando en solucionarlo. Por favor, intenta nuevamente en unos minutos.",
  "selectStudentErrorTitle": "Selecciona un estudiante para ver los planes",
  "selectStudentErrorDescription": "Por favor selecciona un estudiante en el panel superior para cargar sus planes de apoyo existentes.",
  "relationsFixedInfoTitle": "Relaciones corregidas y carga de planes estabilizada",
  "relationsFixedInfoMessage": "Se solucionó un conflicto de duplicación de claves foráneas entre 'support_plans' y las tablas 'students' y 'user_profiles', lo cual impedía la visualización correcta de los planes. Ahora:\n\n• Se eliminó la ambigüedad en las relaciones y se ajustaron los JOIN explícitamente.\n• Se validó que los planes se generen correctamente tras seleccionar un estudiante.\n• El sistema ahora solo intenta cargar los planes **una vez se ha elegido el estudiante**.\n\n🧩 Recomendación: asegúrate de que siempre haya un estudiante seleccionado antes de invocar funciones de carga o resumen. Implementa validaciones preventivas en el flujo de UI para evitar intentos de carga prematuros.",
  "assignTeacherSuccess": "Estudiante(s) asignado(s) correctamente al docente.",
  "assignGuardianSuccess": "Estudiante(s) asignado(s) correctamente al acudiente.",
  "assignError": "No se pudo completar la asignación. Intenta de nuevo.",
  "assignParentSuccess": "Estudiante(s) asignado(s) correctamente al acudiente.",
  "error": "Error",
  "contactFormSuccessTitle": "¡Mensaje Enviado!",
  "contactFormSuccessDescription": "Gracias por contactarnos. Te responderemos pronto.",
  "unauthorizedAccess": "No tienes autorización para acceder a esta sección.",
  "logoutSuccessTitle": "Sesión Cerrada",
  "logoutSuccessDescription": "Has cerrado sesión exitosamente.",
  "warningTitle": "Advertencia",
  "infoTitle": "Información",
  "karyCoreAlertGenerated": "Alerta de KARY CORE generada",
  "karyCoreSuggestionCreated": "Sugerencia de KARY CORE creada",
  "karyCorePlanSuggested": "Plan de apoyo sugerido por KARY CORE"
}